#include<stdio.h>
#define N 20
void main()
{
	int a[N][N],n,i,j,k;
	/*输入矩阵的阶*/
	while(1)
	{
		printf("请输入一个正整数n(n≤20,n是奇数):");
		scanf("%d",&n);			
		if(n!=0&&n<=20&&n%2!=0) 	
		{
			printf("%d阶魔方矩阵.\n",n);
			break;
		}
	}
	/*初始化二维数组*/
	for(i=0;i<n;i++)
		for(j=0;j<n;j++)
			a[i][j]=0;
		/*构造魔方阵*/
		i=0; 				
		j=n/2; 					
		a[i][j]=1; 			/*1放在第1行中间一列*/
		k=2;
		while(k<=n*n)
		{
			i=i-1;			/*行号减1*/
			j=j+1;		/*列号增1*/
			/*如果上一个数位于第1行第n列，当前的数应在上一个数的下面*/
			if(i<0&&j>n-1)	
			{
				i=i+2;		
				j=j-1; 	
			}
			else			
			{
				/*如果上一个数位于第1行，则当前的数应位于最后一行*/
				if(i<0)							
					i=n-1;	
				/*如果上一个数位于第n列，则将当前的数应位于第1列*/
				if(j>n-1)		
					j=0;
			}
			if(a[i][j]==0)	/*当前的数保存到数组中*/
				a[i][j]=k;
			else	/*如果已经有数存在，则放在上一个数的下面*/
			{
				i=i+2; 		
				j=j-1; 	
				a[i][j]=k; 	
			}
			k++;			/*k增加1，准备存放下一个数*/
		}
		/*输出魔方阵*/
		for(i=0;i<n;i++)	
		{
			for(j=0;j<n;j++)	
				printf("%4d",a[i][j]);
			printf("\n");	
		}
}
